app/controllers/admin/abouts_controller.rb

  def index
    @abouts = About.all
---
SELECT `abouts`.* FROM `abouts`

  def show
    @about = About.find(params[:id])
---
SELECT `abouts`.* FROM `abouts` WHERE `abouts`.`id` = 1 LIMIT 1

  def edit
    @about = About.find(params[:id])
---
SELECT `abouts`.* FROM `abouts` WHERE `abouts`.`id` = 1 LIMIT 1

  def update
    @about = About.find(params[:id])
    if @about.update_attributes(params[:about])
---
SELECT `abouts`.* FROM `abouts` WHERE `abouts`.`id` = 1 LIMIT 1
UPDATE `abouts` SET `updated_at` = '2016-07-14 20:17:23', `description` = '<p>Tortor faucibus ullamcorper nec tempus purus sed penatibus. Lacinia pellentesque eleifend vitae est elit tristique velit tempus etiam.</p>\r\n<p>Tortor faucibus ullamcorper nec tempus purus sed penatibus. Lacinia pellentesque eleifend vitae est elit tristique velit tempus etiam.</p>\r\n<p>Tortor faucibus ullamcorper nec tempus purus sed penatibus. Lacinia pellentesque eleifend vitae est elit tristique velit tempus etiam.</p>\r\n<p>Tortor faucibus ullamcorper nec tempus purus sed penatibus. Lacinia pellentesque eleifend vitae est elit tristique velit tempus etiam.</p>' WHERE `abouts`.`id` = 1