app/controllers/admin/portifolios_controller.rb

SELECT `portifolios`.* FROM `portifolios` WHERE `portifolios`.`id` = 1 LIMIT 1
---
  def show
    @portifolio = Portifolio.find(params[:id])

INSERT INTO `portifolios` (`active`, `created_at`, `description`, `image_portifolio_content_type`, `image_portifolio_file_name`, `image_portifolio_file_size`, `image_portifolio_updated_at`, `ordem`, `published`, `title`, `updated_at`) VALUES (1, '2016-07-15 15:57:24', '<p>Tortor faucibus ullamcorper nec tempus purus sed penatibus. Lacinia pellentesque eleifend vitae est elit tristique velit tempus etiam.</p>', 'image/jpeg', 'claro-cult.jpg', 457172, '2016-07-15 15:57:23', 1, 1, 'logos', '2016-07-15 15:57:24')
---
  def create
    @portifolio = Portifolio.new(params[:portifolio])
    if @portifolio.save

SELECT `portifolios`.* FROM `portifolios` WHERE `portifolios`.`id` = 1 LIMIT 1
---
  def edit
    @portifolio = Portifolio.find(params[:id])

SELECT `portifolios`.* FROM `portifolios` WHERE `portifolios`.`id` = 1 LIMIT 1
---
  def destroy
    @portifolio = Portifolio.find(params[:id])