app/controllers/admin/portifolio_images_controller.rb

  def show
    @portifolio_image = @portifolio.portifolio_images.find(params[:id])
---
SELECT `portifolio_images`.* FROM `portifolio_images` WHERE `portifolio_images`.`portifolio_id` = 1 AND `portifolio_images`.`id` = 1 LIMIT 1
SELECT `portifolios`.* FROM `portifolios` WHERE `portifolios`.`id` = 1 LIMIT 1

  def create
    @portifolio_image = @portifolio.portifolio_images.build(params[:portifolio_image])
    if @portifolio_image.save
---
INSERT INTO `portifolio_images` (`active`, `created_at`, `image_portifolio_image_content_type`, `image_portifolio_image_file_name`, `image_portifolio_image_file_size`, `image_portifolio_image_updated_at`, `ordem`, `portifolio_id`, `published`, `title`, `updated_at`) VALUES (1, '2016-07-15 16:12:08', NULL, NULL, NULL, NULL, 1, 1, 1, NULL, '2016-07-15 16:12:08')

  def edit
    @portifolio_image = @portifolio.portifolio_images.find(params[:id])
---
SELECT `portifolio_images`.* FROM `portifolio_images` WHERE `portifolio_images`.`portifolio_id` = 1 AND `portifolio_images`.`id` = 1 LIMIT 1
SELECT `portifolios`.* FROM `portifolios` WHERE `portifolios`.`id` = 1 LIMIT 1

  def update
    @portifolio_image = @portifolio.portifolio_images.find(params[:id])
    if @portifolio_image.update_attributes(params[:portifolio_image])
---
SELECT `portifolio_images`.* FROM `portifolio_images` WHERE `portifolio_images`.`portifolio_id` = 1 AND `portifolio_images`.`id` = 1 LIMIT 1
SELECT `portifolios`.* FROM `portifolios` WHERE `portifolios`.`id` = 1 LIMIT 1
UPDATE `portifolio_images` SET `image_portifolio_file_name` = 'Estudo_Logo_5_200.png', `image_portifolio_content_type` = 'image/png', `updated_at` = '2016-07-15 19:38:26', `image_portifolio_file_size` = 17543 WHERE `portifolio_images`.`id` = 5

  def destroy
    @portifolio_image = @portifolio.portifolio_images.find(params[:id])
---
SELECT `portifolio_images`.* FROM `portifolio_images` WHERE `portifolio_images`.`portifolio_id` = 1 AND `portifolio_images`.`id` = 1 LIMIT 1
SELECT `portifolios`.* FROM `portifolios` WHERE `portifolios`.`id` = 1 LIMIT 1

  def load_portifolio
    @portifolio = Portifolio.find(params[:portifolio_id])
---
SELECT `portifolios`.* FROM `portifolios` WHERE `portifolios`.`id` = 1 LIMIT 1