app/views/portifolios/show.html.erb

SELECT `portifolio_images`.* FROM `portifolio_images` WHERE `portifolio_images`.`portifolio_id` = 1 AND (portifolio_images.active = true AND portifolio_images.published = true)
---
    <div class="row 0%">
    <% @portifolios.portifolio_images.where("portifolio_images.active = true AND portifolio_images.published = true").each do |img|%>