app/controllers/homes_controller.rb

SELECT `abouts`.* FROM `abouts`
---
  def index
    @abouts = About.all