app/controllers/portifolios_controller.rb

SELECT `portifolios`.* FROM `portifolios` WHERE `portifolios`.`id` = 1 AND (portifolio_images.published = true AND portifolio_images.active = true) LIMIT 1
---
  def show
    @portifolios = Portifolio.find(params[:id])